04_OpenFoam/_Tut_02/OpenFOAM-14/XiFluid/stratified/constant/fvModels
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvModels;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ignition
{
    type            constantbXiIgnition;

    cellZone        ignition;

    start           0;
    duration        0.0001;
    strength        1;
}

correction
{
    type            bXiKernelCorr;

    cellZone        all;

    ignition        ignition;

    duration        0.01;

    kernelShape
    {
        type            cylindrical;
        thickness       0.001;
        cylinderFraction 0.25;
    }
}


// ************************************************************************* //
